"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Estrai nella cartella corrente";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Estrai in Scrivania";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Estrai in...";
